Tekla Open API Reference for Tekla Structures 2025
StraightDimension Constructor
Overload List
Name | Description
StraightDimension(ViewBase, Point, Point, Vector, Double)
 Initializes a new instance of the StraightDimension class using "standard" attributes.
StraightDimension(ViewBase, Point, Point, Vector, Double, StraightDimensionSet.StraightDimensionSetAttributes)
 Initializes a new instance of the StraightDimension class.
Top
See Also
Reference
StraightDimension Class
Tekla.Structures.Drawing Namespace